<h1 style="color:blue;">Pandas</h1>

In [5]:
import pandas as pd
import numpy as np

In [6]:
Df = pd.DataFrame()

In [9]:
print(Df)

Empty DataFrame
Columns: []
Index: []

In [12]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[3,6,8,23],[23,23,63,12]])

In [13]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [18]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[3,6,8,23],[23,23,63,12]],
columns=['A','B','C','D'])

In [19]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [21]:
df1.head(3)

   A  B  C   D
0  1  2  3   4
1  5  6  7   8
2  3  6  8  23

In [22]:
df1.tail(3)

    A   B   C   D
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [26]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [25]:
df1.iloc[0:2,0:2]

   A  B
0  1  2
1  5  6

In [30]:
df1.to_csv('Test.csv')

In [35]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   3   6   8  23
3  23  23  63  12

In [31]:
df2 = pd.DataFrame([[11,2,31],[5,7,7],[13,3,33]],
columns=['A1','B1','C1'])

In [32]:
df2

   A1  B1  C1
0  11   2  31
1   5   7   7
2  13   3  33

In [33]:
df3=pd.merge(df1,df2,right_on='B1',left_on='B')

In [36]:
df3

   A  B  C  D  A1  B1  C1
0  1  2  3  4  11   2  31

In [27]:
df = pd.read_csv('annual-enterprise-survey-2023-financial-year-provisional.csv')

In [28]:
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...